mon-projet-express-typescript/tests/test-load.yaml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60  # Durée du test en secondes
      arrivalRate: 10  # Requêtes par seconde
scenarios:
  - flow:
      - post:
          url: "/v1/users/register"
          headers:
            Content-Type: "application/json"
          body: |
            {
              "id": 1,
              "name": "John Doe", 
              "email": "john.doe@example.com", 
              "password": "securepassword",
              "role": "Admin",
              "username": "johndoe"
            }